{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "Hi",
        "I need help",
        "How are you",
        "Is anyone there?",
        "Hello",
        "Good day"
      ],
      "responses": [
        "Hey :-)",
        "Hello",
        "Hi there, what can I do for you?",
        "Hi there, how can I help?"
      ]
    },
    {
      "tag": "goodbye",
      "patterns": ["Bye", "See you later", "Goodbye"],
      "responses": [
        "See you later, thanks for visiting",
        "Have a nice day",
        "Bye! Come back again soon."
      ]
    },
    {
      "tag": "thanks",
      "patterns": ["Thanks", "Thank you", "That's helpful", "Thanks a lot!"],
      "responses": [
        "Happy to help!", "Any time!", "My pleasure"
      ]
    },
    {
      "tag": "unable to log into ctc",
      "patterns": [
        "I can't log into my ctclink account",
        "unable to log in to ctc link",
        "cant log in to ctc link"
      ],
      "responses": [
        "Please make sure that you have already activated your ctclink account, otherwise try to rest password or contact us"
      ]
    },
    {
      "tag": "activate ctc",
      "patterns": [
        "Can you show me how to activate ctc",
        "I need help to activate my ctclink account"
      ],
      "responses": [
        "Yes of course! Please follow the guides on this spreadsheet to activate your ctclink account"
      ]
    },
    {
      "tag": "ctc verification code",
      "patterns": [
        "I can't receive the verification code for ctc link to do a password reset",
        "I am supposed to receive the verification code in text message for ctc link but i am not receiving it",
        "I am supposed to receive the verification code in email for ctc link but i am not receiving it"

      ],
      "responses": [
        "If you are not receiving verification code for ctclink, that means you have not set up MFA before, please visit us for assistance"
      ]
    },
    {
      "tag": "email log in",
      "patterns": [
        "I can't log in to my student email",
        "I can't log into my student email",
        "I a new student and was given a temporary password to log in to my email but it is not working"
      ],
      "responses": [
        "For new student, please log in using CTCDDMMYY as temporary password, proceed to set up a new password that is at least 12 characters long"
      ]
    },
    {
      "tag": "microsoft authenticator app",
      "patterns": [
        "I need help to log in to my student email because my authenticator app is not working",
        "I just got a new phone and my microsoft authenticator app is not working",
        "I just changed a new phone and my microsoft authenticator app is not working",
        "I just got a new phone number and my microsoft authenticator app is not working",
        "I just changed a new phone number and my microsoft authenticator app is not working",
        "I cant get the code for microsoft authenticator"
      ],
      "responses": [
        "Please vist us to reset MFA and set up Microsoft authenticator app again"
      ]
    },
    {
      "tag": "find ctclink id",
      "patterns": [
        "I forgot my ctc link id",
        "What is my ctc link id",
        "How to find my ctc link id",
        "I want to look up my ctc link id",
        "I want to know my ctc link id"
      ],
      "responses": [
        "Unfortunately, there is no way for you to self look up ctclink id, please visit us for assistance"
      ]
    },
    {
      "tag": "find student email",
      "patterns": [
        "I forgot what is my student email",
        "I want to find my student email",
        "I want to know my student email",
        "How to find my student email"
      ],
      "responses": [
        "To find you student email, please use the email look up tool"
      ]
    },
    {
      "tag": "general password reset",
      "patterns": [
        "I need help to reset my password",
        "I want to reset my password",
        "I want to change my password",
        "I can't change my password",
        "I can't reset my password"
      ],
      "responses": [
        "Please be more specific in your issue and state whether you need help to reset password for ctclink, student email, or canvas"
      ]
    },
    {
      "tag": "canvas",
      "patterns": [
        "I cant log in to canvas",
        "My canvas is not working"
      ],
      "responses": [
        "Please log in to your student email to troubleshoot your issue, if you are able to log in to your email but not canvase, please contact e-learning, otherwise visit us for assistance "
      ]
    }
  ]
}